modules/hrm/models/BankAccountQuery.php

SELECT * FROM `bank_account` ORDER BY `id`
---
    public function all($db = null)
    {
        return parent::all($db);