modules/hrm/models/EmployeehasskillQuery.php

SELECT * FROM `employeehasskill` WHERE 0=1
---
    public function all($db = null)
    {
        return parent::all($db);