modules/hrm/models/EmployeeQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `employee` ORDER BY `id`