modules/hrm/models/FamilyAllowanceQuery.php

SELECT * FROM `family_allowance` ORDER BY `id`
---
    public function all($db = null)
    {
        return parent::all($db);