modules/hrm/models/HrmBankAccountQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `hrm_bank_account` ORDER BY `id`