modules/hrm/models/HrmEmployeehaslevelQuery.php

SELECT * FROM `hrm_employeehaslevel` WHERE `employee_id`=11
---
    public function all($db = null)
    {
        return parent::all($db);