modules/hrm/models/HrmEmployeeQuery.php

SELECT * FROM `hrm_employee` ORDER BY `id`
---
    public function all($db = null)
    {
        return parent::all($db);