modules/hrm/models/HrmFamilyAllowanceQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `hrm_family_allowance` ORDER BY `id`