modules/hrm/models/HrmKeyResultAreaQuery.php

SELECT * FROM `hrm_key_result_area` ORDER BY `id`
---
    public function all($db = null)
    {
        return parent::all($db);