modules/hrm/models/HrmLevelQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `hrm_level` ORDER BY `id`