modules/hrm/models/HrmSalaryQuery.php

SELECT * FROM `hrm_salary` WHERE 0=1
---
    public function all($db = null)
    {
        return parent::all($db);