modules/hrm/models/HrmShiftQuery.php

SELECT * FROM `hrm_shift` ORDER BY `id`
---
    public function all($db = null)
    {
        return parent::all($db);