modules/hrm/models/HrmSkillQuery.php

SELECT * FROM `hrm_skill` WHERE 0=1
---
    public function all($db = null)
    {
        return parent::all($db);