modules/hrm/models/HrmTrainingQuery.php

SELECT * FROM `hrm_training` ORDER BY `id`
---
    public function all($db = null)
    {
        return parent::all($db);