modules/hrm/models/HrmWorkExpQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `hrm_work_exp` ORDER BY `id`