modules/hrm/models/MasterPersonnelSubAreaQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `master_personnel_sub_area` ORDER BY `id`