modules/hrm/models/PayrollQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `payroll` WHERE 0=1