modules/hrm/models/PersonnelSubAreaQuery.php

SELECT * FROM `personnel_sub_area` ORDER BY `id`
---
    public function all($db = null)
    {
        return parent::all($db);