modules/hrm/models/PositionsQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `positions` WHERE 0=1