modules/hrm/models/SalaryQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `salary` WHERE 0=1