modules/hrm/models/SasaranStrategisQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `sasaran_strategis` WHERE 0=1