modules/hrm/models/SubSkillQuery.php

SELECT * FROM `sub_skill` ORDER BY `id`
---
    public function all($db = null)
    {
        return parent::all($db);