modules/hrm/models/WorkExpQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `work_exp` ORDER BY `id`